       IDENTIFICATION DIVISION.
       PROGRAM-ID. AB2.
       PROCEDURE DIVISION.
           DISPLAY 'BEFORE'.
           CALL 'CEE3ABD'.
           DISPLAY 'AFTER'.
           STOP RUN.
