       IDENTIFICATION DIVISION.
       PROGRAM-ID. BW1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  TWO-BYTES-BINARY        PIC 9(4) BINARY.
       01  TWO-BYTES-ALPHA         REDEFINES TWO-BYTES-BINARY.
           05  TWO-BYTES-LEFT      PIC X.
           05  TWO-BYTES-RIGHT     PIC X.
       01  IO-STATUS-04.
           05  IO-STATUS-0401      PIC 9   VALUE 0.
           05  IO-STATUS-0403      PIC 999 VALUE 0.
       PROCEDURE DIVISION.
           DISPLAY "SIZE=" FUNCTION LENGTH(TWO-BYTES-BINARY).
           DISPLAY "GRPSIZE=" FUNCTION LENGTH(TWO-BYTES-ALPHA).

           MOVE 0 TO TWO-BYTES-BINARY
           MOVE "9" TO TWO-BYTES-RIGHT
           MOVE TWO-BYTES-BINARY TO IO-STATUS-0403
           DISPLAY "RIGHT9_BIN=" TWO-BYTES-BINARY
           DISPLAY "RIGHT9_003=" IO-STATUS-0403

           MOVE 0 TO TWO-BYTES-BINARY
           MOVE "0" TO TWO-BYTES-RIGHT
           MOVE TWO-BYTES-BINARY TO IO-STATUS-0403
           DISPLAY "RIGHT0_BIN=" TWO-BYTES-BINARY

           MOVE 0 TO TWO-BYTES-BINARY
           MOVE "9" TO TWO-BYTES-LEFT
           MOVE TWO-BYTES-BINARY TO IO-STATUS-0403
           DISPLAY "LEFT9_BIN=" TWO-BYTES-BINARY
           DISPLAY "LEFT9_003=" IO-STATUS-0403

           MOVE "ABCD" TO IO-STATUS-04
           MOVE "X" TO IO-STATUS-04(1:1)
           DISPLAY "REFMOD11=" IO-STATUS-04
           MOVE "ABCD" TO IO-STATUS-04
           MOVE "YZ" TO IO-STATUS-04(3:2)
           DISPLAY "REFMOD32=" IO-STATUS-04
           STOP RUN.
