       IDENTIFICATION DIVISION.
       PROGRAM-ID. CS6.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       OBJECT-COMPUTER. XXX
           PROGRAM COLLATING SEQUENCE IS EB.
       SPECIAL-NAMES.
           ALPHABET EB IS EBCDIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  A1 PIC X(2) VALUE "AB".
       01  A2 PIC X(2) VALUE "AC".
       01  D1 PIC X(2) VALUE "12".
       01  D2 PIC X(2) VALUE "13".
       01  M1 PIC X(2) VALUE "A1".
       01  M2 PIC X(2) VALUE "1A".
       01  DT1 PIC X(10) VALUE "2026-01-31".
       01  DT2 PIC X(10) VALUE "2026-02-01".
       PROCEDURE DIVISION.
           IF A1 < A2 DISPLAY "UPPER_ORDER=SAME"
           ELSE DISPLAY "UPPER_ORDER=FLIPPED" END-IF
           IF D1 < D2 DISPLAY "DIGIT_ORDER=SAME"
           ELSE DISPLAY "DIGIT_ORDER=FLIPPED" END-IF
           IF DT1 < DT2 DISPLAY "DATE_ORDER=SAME"
           ELSE DISPLAY "DATE_ORDER=FLIPPED" END-IF
           IF M1 < M2 DISPLAY "MIXED=A1_LT_1A"
           ELSE DISPLAY "MIXED=A1_GE_1A" END-IF
           STOP RUN.
